Catalogs/упАналитическиеРазрезыПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упАналитическиеРазрезыПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упАналитическиеРазрезыПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упАналитическиеРазрезыПоПартнерам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АналитическийРазрезПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАналитическиеРазрезыПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/упАналитическиеРазрезыПоПартнерам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Нет.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	упАналитическиеРазрезыПоПартнерам.Партнер,
	               |	упАналитическиеРазрезыПоПартнерам.Организация,
	               |	упАналитическиеРазрезыПоПартнерам.Соглашение,
	               |	упАналитическиеРазрезыПоПартнерам.Контрагент,
	               |	упАналитическиеРазрезыПоПартнерам.АналитическийРазрезПоПартнерам
	               |ИЗ
	               |	РегистрСведений.упАналитическиеРазрезыПоПартнерам КАК упАналитическиеРазрезыПоПартнерам
	               |ГДЕ
	               |	упАналитическиеРазрезыПоПартнерам.АналитическийРазрезПоПартнерам = &АналитическийРазрезПоПартнерам";
	Запрос.УстановитьПараметр("АналитическийРазрезПоПартнерам", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		упУправленияЗаявками.СформироватьАналитическиеРазрезыПоПартнерам(Партнер,,Организация,,Соглашение,,Контрагент,,Ссылка,Отказ);
	Иначе
		Выборка	= Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			упУправленияЗаявками.СформироватьАналитическиеРазрезыПоПартнерам(Партнер,Выборка.Партнер,Организация, Выборка.Организация,Соглашение,Выборка.Соглашение, Контрагент,Выборка.Контрагент,Ссылка,Отказ);		
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Нет.

#КонецОбласти

#КонецЕсли
